---
kind: method
id: M:Autodesk.Revit.DB.IFC.IIFCImporterServer.ImportIFC(Autodesk.Revit.DB.IFC.ImporterIFC)
source: html/d532be0b-f9f4-f7d5-e327-6240f63f1cf0.htm
---
# Autodesk.Revit.DB.IFC.IIFCImporterServer.ImportIFC Method

The method that Revit will invoke to perform an import from IFC.

## Syntax (C#)
```csharp
void ImportIFC(
	ImporterIFC importer
)
```

## Parameters
- **importer** (`Autodesk.Revit.DB.IFC.ImporterIFC`) - The IFC importer.